# running in formal_core/src/
read -formal ../src/sovereign_core_top.sv
read -formal ../src/string_resonant_alu.sv
read -formal ../src/subnet_charter_reg.sv
read -formal ../src/transaction_routing_alu.sv
read -formal formal_properties.sv
prep -top formal_properties

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
